{"format":"graph-model","generatedBy":"2.9.0","convertedBy":"TensorFlow.js Converter v3.19.0","signature":{"inputs":{"input":{"name":"input:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}},"outputs":{"predictions":{"name":"Identity:0","dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"-1"},{"size":"2"}]}}}},"modelTopology":{"node":[{"name":"StatefulPartitionedCall/model/tf.compat.v1.pad/Pad/paddings","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}}}},{"name":"StatefulPartitionedCall/model/global_average_pooling2d/Mean/reduction_indices","op":"Const","attr":{"dtype":{"type":"DT_INT32"},"value":{"tensor":{"dtype":"DT_INT32","tensorShape":{"dim":[{"size":"2"}]}}}}},{"name":"StatefulPartitionedCall/model/fc_nsfw/MatMul/ReadVariableOp","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"},{"size":"2"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/fc_nsfw/BiasAdd/ReadVariableOp","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"2"}]}}}}},{"name":"input","op":"Placeholder","attr":{"dtype":{"type":"DT_FLOAT"},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"224"},{"size":"224"},{"size":"3"}]}}}},{"name":"StatefulPartitionedCall/model/conv_1/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"7"},{"size":"7"},{"size":"3"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_1/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_proj_shortcut/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_proj_shortcut/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block0_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2a/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block1_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"32"},{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"32"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"32"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage0_block2_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_proj_shortcut/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_proj_shortcut/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block0_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block5_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block1_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block2_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_proj_shortcut/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_proj_shortcut/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage1_block3_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2a/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_proj_shortcut/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_proj_shortcut/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block0_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2a/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block0_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2b/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block1_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2a/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"1024"},{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2c/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2b/Conv2D_weights","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2a/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block2_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2a/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2a/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block2_branch2c/Conv2D_bn_offset","op":"Const","attr":{"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1024"}]}}},"dtype":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2b/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"256"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2b/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"128"},{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block3_branch2c/Conv2D_bn_offset","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"512"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage2_block4_branch2a/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"512"},{"size":"128"}]}}}}},{"name":"StatefulPartitionedCall/model/conv_stage3_block1_branch2c/Conv2D_weights","op":"Const","attr":{"dtype":{"type":"DT_FLOAT"},"value":{"tensor":{"dtype":"DT_FLOAT","tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"256"},{"size":"1024"}]}}}}},{"name":"StatefulPartitionedCall/model/tf.compat.v1.pad/Pad","op":"Pad","input":["input","StatefulPartitionedCall/model/tf.compat.v1.pad/Pad/paddings"],"attr":{"T":{"type":"DT_FLOAT"},"Tpaddings":{"type":"DT_INT32"}}},{"name":"StatefulPartitionedCall/model/activation/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/tf.compat.v1.pad/Pad","StatefulPartitionedCall/model/conv_1/Conv2D_weights","StatefulPartitionedCall/model/conv_1/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"VkFMSUQ="},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/max_pooling2d/MaxPool","op":"MaxPool","input":["StatefulPartitionedCall/model/activation/Relu"],"attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"ksize":{"list":{"i":["1","3","3","1"]}},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block0_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/max_pooling2d/MaxPool","StatefulPartitionedCall/model/conv_stage0_block0_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block0_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/model/bn_stage0_block0_proj_shortcut/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/max_pooling2d/MaxPool","StatefulPartitionedCall/model/conv_stage0_block0_proj_shortcut/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block0_proj_shortcut/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"num_args":{"i":"1"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block0_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block0_branch2a/Relu","StatefulPartitionedCall/model/conv_stage0_block0_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block0_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/bn_stage0_block0_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block0_branch2b/Relu","StatefulPartitionedCall/model/conv_stage0_block0_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block0_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/add/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage0_block0_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/bn_stage0_block0_proj_shortcut/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block0/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block1_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block0/Relu","StatefulPartitionedCall/model/conv_stage0_block1_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block1_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block1_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block1_branch2a/Relu","StatefulPartitionedCall/model/conv_stage0_block1_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block1_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}}}},{"name":"StatefulPartitionedCall/model/bn_stage0_block1_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block1_branch2b/Relu","StatefulPartitionedCall/model/conv_stage0_block1_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block1_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true}}},{"name":"StatefulPartitionedCall/model/add_1/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage0_block1_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/activation_stage0_block0/Relu"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block1/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_1/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block2_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block1/Relu","StatefulPartitionedCall/model/conv_stage0_block2_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block2_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block2_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block2_branch2a/Relu","StatefulPartitionedCall/model/conv_stage0_block2_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block2_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0}}},{"name":"StatefulPartitionedCall/model/bn_stage0_block2_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block2_branch2b/Relu","StatefulPartitionedCall/model/conv_stage0_block2_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage0_block2_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"}}},{"name":"StatefulPartitionedCall/model/add_2/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage0_block2_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/activation_stage0_block1/Relu"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage0_block2/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_2/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block0_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block2/Relu","StatefulPartitionedCall/model/conv_stage1_block0_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block0_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","2","2","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/bn_stage1_block0_proj_shortcut/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage0_block2/Relu","StatefulPartitionedCall/model/conv_stage1_block0_proj_shortcut/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block0_proj_shortcut/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"use_cudnn_on_gpu":{"b":true},"epsilon":{"f":0},"num_args":{"i":"1"},"strides":{"list":{"i":["1","2","2","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"padding":{"s":"U0FNRQ=="},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block0_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block0_branch2a/Relu","StatefulPartitionedCall/model/conv_stage1_block0_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block0_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"explicit_paddings":{"list":{}},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"padding":{"s":"U0FNRQ=="},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/bn_stage1_block0_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block0_branch2b/Relu","StatefulPartitionedCall/model/conv_stage1_block0_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block0_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/model/add_3/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage1_block0_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/bn_stage1_block0_proj_shortcut/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block0/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_3/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block1_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block0/Relu","StatefulPartitionedCall/model/conv_stage1_block1_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block1_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block1_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block1_branch2a/Relu","StatefulPartitionedCall/model/conv_stage1_block1_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block1_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"use_cudnn_on_gpu":{"b":true}}},{"name":"StatefulPartitionedCall/model/bn_stage1_block1_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block1_branch2b/Relu","StatefulPartitionedCall/model/conv_stage1_block1_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block1_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"strides":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/add_4/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage1_block1_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/activation_stage1_block0/Relu"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block1/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_4/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block2_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block1/Relu","StatefulPartitionedCall/model/conv_stage1_block2_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block2_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"num_args":{"i":"1"},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block2_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block2_branch2a/Relu","StatefulPartitionedCall/model/conv_stage1_block2_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block2_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0},"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="}}},{"name":"StatefulPartitionedCall/model/bn_stage1_block2_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block2_branch2b/Relu","StatefulPartitionedCall/model/conv_stage1_block2_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block2_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"strides":{"list":{"i":["1","1","1","1"]}},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"padding":{"s":"U0FNRQ=="},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/add_5/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage1_block2_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/activation_stage1_block1/Relu"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block2/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_5/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block3_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block2/Relu","StatefulPartitionedCall/model/conv_stage1_block3_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block3_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"strides":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"explicit_paddings":{"list":{}},"T":{"type":"DT_FLOAT"},"data_format":{"s":"TkhXQw=="},"epsilon":{"f":0},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block3_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block3_branch2a/Relu","StatefulPartitionedCall/model/conv_stage1_block3_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block3_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"num_args":{"i":"1"}}},{"name":"StatefulPartitionedCall/model/bn_stage1_block3_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block3_branch2b/Relu","StatefulPartitionedCall/model/conv_stage1_block3_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage1_block3_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"strides":{"list":{"i":["1","1","1","1"]}},"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"epsilon":{"f":0},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/add_6/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage1_block3_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/activation_stage1_block2/Relu"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage1_block3/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_6/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage2_block0_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block3/Relu","StatefulPartitionedCall/model/conv_stage2_block0_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage2_block0_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"epsilon":{"f":0},"num_args":{"i":"1"},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"padding":{"s":"U0FNRQ=="},"explicit_paddings":{"list":{}},"dilations":{"list":{"i":["1","1","1","1"]}},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"strides":{"list":{"i":["1","2","2","1"]}},"data_format":{"s":"TkhXQw=="}}},{"name":"StatefulPartitionedCall/model/bn_stage2_block0_proj_shortcut/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage1_block3/Relu","StatefulPartitionedCall/model/conv_stage2_block0_proj_shortcut/Conv2D_weights","StatefulPartitionedCall/model/conv_stage2_block0_proj_shortcut/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"data_format":{"s":"TkhXQw=="},"use_cudnn_on_gpu":{"b":true},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"num_args":{"i":"1"},"strides":{"list":{"i":["1","2","2","1"]}},"dilations":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}},"epsilon":{"f":0},"padding":{"s":"U0FNRQ=="},"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage2_block0_branch2b/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage2_block0_branch2a/Relu","StatefulPartitionedCall/model/conv_stage2_block0_branch2b/Conv2D_weights","StatefulPartitionedCall/model/conv_stage2_block0_branch2b/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"strides":{"list":{"i":["1","1","1","1"]}},"T":{"type":"DT_FLOAT"},"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"epsilon":{"f":0},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"}}},{"name":"StatefulPartitionedCall/model/bn_stage2_block0_branch2c/FusedBatchNormV3","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage2_block0_branch2b/Relu","StatefulPartitionedCall/model/conv_stage2_block0_branch2c/Conv2D_weights","StatefulPartitionedCall/model/conv_stage2_block0_branch2c/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"explicit_paddings":{"list":{}},"data_format":{"s":"TkhXQw=="},"strides":{"list":{"i":["1","1","1","1"]}},"padding":{"s":"U0FNRQ=="},"fused_ops":{"list":{"s":["Qmlhc0FkZA=="]}},"use_cudnn_on_gpu":{"b":true},"dilations":{"list":{"i":["1","1","1","1"]}},"num_args":{"i":"1"},"T":{"type":"DT_FLOAT"},"epsilon":{"f":0}}},{"name":"StatefulPartitionedCall/model/add_7/add","op":"AddV2","input":["StatefulPartitionedCall/model/bn_stage2_block0_branch2c/FusedBatchNormV3","StatefulPartitionedCall/model/bn_stage2_block0_proj_shortcut/FusedBatchNormV3"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage2_block0/Relu","op":"Relu","input":["StatefulPartitionedCall/model/add_7/add"],"attr":{"T":{"type":"DT_FLOAT"}}},{"name":"StatefulPartitionedCall/model/activation_stage2_block1_branch2a/Relu","op":"_FusedConv2D","input":["StatefulPartitionedCall/model/activation_stage2_block0/Relu","StatefulPartitionedCall/model/conv_stage2_block1_branch2a/Conv2D_weights","StatefulPartitionedCall/model/conv_stage2_block1_branch2a/Conv2D_bn_offset"],"device":"/device:CPU:0","attr":{"fused_ops":{"list":{"s":["Qmlhc0FkZA==","UmVsdQ=="]}},"epsilon":{"f":0},"data_format":{"s":"TkhXQw=="},"padding":{"s":"U0FNRQ=="},"use_cudnn_on_gpu":{"b":true},"T":{"type":"DT_FLOAT"},"num_args":{"i":"1"},"dilations":{"list":{"i":["1","1","1","1"]}},"strides":{"list":{"i":["1","1","1","1"]}},"explicit_paddings":{"list":{}}}},